            FD FD-IDIOMAS.
            01 RG-IDIOMA.
                05 AACOD        PIC X(3).           *> Código alpha-3
                05 AANOM        PIC X(80).          *> Nombrre
                05 AAACT        PIC 9.              *> Activo/inactivo
                