            FD FD-PAISES.
            01 RG-PAIS.
                05 ABCOD        PIC X(2).           *> Código alpha-2
                05 ABCD3        PIC X(3).           *> Código alpha-3
                05 ABNUM        PIC 9(3).           *> Código numérico
                05 ABNOM        PIC X(80).          *> Nombre
                05 ABACT        PIC 9.              *> Activo/Inactivo
                