            FD FD-USUARIOS.
            01 RG-USUARIO.
                05 ACCOD        PIC X(20).          *> Código
                05 ACNOM        PIC X(80).          *> Nombre
                05 ACACT        PIC 9.              *> Activo/Inactivo
                