       IDENTIFICATION DIVISION.
       PROGRAM-ID. SANDBOX.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY. 
        FUNCTION ALL INTRINSIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 USUARIO  PIC X(10).
        01 SESION   PIC X(40).
       PROCEDURE DIVISION.

        DISPLAY LENGTH(USUARIO)
        DISPLAY LENGTH(SESION)

        IF USUARIO = SPACES THEN
            DISPLAY "ES BLANCOS"
        END-IF

        MOVE "PEPITO" TO USUARIO
        IF USUARIO = SPACES THEN
            DISPLAY "ES BLANCOS"
        END-IF


        STOP RUN. 
